-- +goose Up
-- +goose StatementBegin
CREATE TABLE teacher_albums
(
    id    serial PRIMARY KEY,
    name  VARCHAR(100),
    url   VARCHAR(255),
    vk_id INT
);

INSERT INTO teacher_albums (name, url, vk_id)
VALUES ('Абулкасимов Манас Мукитович', 'https://vk.com/album-211704031_283523239', 123),
       ('Аксёнова Мария Владимировна', 'https://vk.com/album-211704031_283523240', '123'),
       ('Аладин Дмитрий Владимирович', 'https://vk.com/album-211704031_283523241', '123'),
       ('Али Диб Ахмада', 'https://vk.com/album-211704031_283523242', '123'),
       ('Антонов Артем Ильич', 'https://vk.com/album-211704031_283523243', '123'),
       ('Афанасьев Арсений Геннадьевич', 'https://vk.com/album-211704031_283523244', '123'),
       ('Афанасьев Геннадий Иванович', 'https://vk.com/album-211704031_283523245', '123'),
       ('Балашов Антон Михайлович', 'https://vk.com/album-211704031_283523246', '123'),
       ('Балдин Александр Викторович', 'https://vk.com/album-211704031_283523247', '123'),
       ('Белодедов Михаил Владимирович', 'https://vk.com/album-211704031_283523248', '123'),
       ('Большаков Сергей Алексеевич', 'https://vk.com/album-211704031_283523249', '123'),
       ('Булатова Ирина Георгиевна', 'https://vk.com/album-211704031_283523250', '123'),
       ('Варламов Олег Олегович', 'https://vk.com/album-211704031_283523251', '123'),
       ('Виноградова Мария Валерьевна', 'https://vk.com/album-211704031_283523252', '123'),
       ('Волков Артём Сергеевич', 'https://vk.com/album-211704031_283523253', '123'),
       ('Галкин Валерий Александрович', 'https://vk.com/album-211704031_283523254', '123'),
       ('Гапанюк Юрий Евгеньевич', 'https://vk.com/album-211704031_283523255', '123'),
       ('Горячкин Борис Сергеевич', 'https://vk.com/album-211704031_283523256', '123'),
       ('Григорьев Юрий Александрович', 'https://vk.com/album-211704031_283523257', '123'),
       ('Дятленко Елена Александровна', 'https://vk.com/album-211704031_283523258', '123'),
       ('Ишков Денис Олегович', 'https://vk.com/album-211704031_283523259', '123'),
       ('Калистратов Алексей Павлович', 'https://vk.com/album-211704031_283523260', '123'),
       ('Канев Антон Игоревич', 'https://vk.com/album-211704031_283523261', '123'),
       ('Карабулатова Ирина Советовна', 'https://vk.com/album-211704031_283523262', '123'),
       ('Кесель Сергей Александрович', 'https://vk.com/album-211704031_283523263', '123'),
       ('Ковалева Наталья Александровна', 'https://vk.com/album-211704031_283523264', '123'),
       ('Кротов Юрий Николаевич', 'https://vk.com/album-211704031_283523265', '123'),
       ('Крутов Тимофей Юрьевич', 'https://vk.com/album-211704031_283523266', '123'),
       ('Лабунец Леонид Витальевич', 'https://vk.com/album-211704031_283523267', '123'),
       ('Лосева Светлана Сергеевна', 'https://vk.com/album-211704031_283523268', '123'),
       ('Максаков Алексей Александрович', 'https://vk.com/album-211704031_283523269', '123'),
       ('Масленников Константин Юрьевич', 'https://vk.com/album-211704031_283523270', '123'),
       ('Машкин Константин Вилиорович', 'https://vk.com/album-211704031_283523271', '123'),
       ('Михеев Вячеслав Алексеевич', 'https://vk.com/album-211704031_283523272', '123'),
       ('Мышенков Константин Сергеевич', 'https://vk.com/album-211704031_283523273', '123'),
       ('Нардид Анатолий Николаевич', 'https://vk.com/album-211704031_283523274', '123'),
       ('Нестеров Юрий Григорьевич', 'https://vk.com/album-211704031_283523275', '123'),
       ('Плужникова Ольга Юрьевна', 'https://vk.com/album-211704031_283523276', '123'),
       ('Постников Виталий Михайлович', 'https://vk.com/album-211704031_283523277', '123'),
       ('Правдина Анна Дмитриевна', 'https://vk.com/album-211704031_283523278', '123'),
       ('Попов Илья Андреевич', 'https://vk.com/album-211704031_283523279', '123'),
       ('Самохвалов Алексей Эдуардович', 'https://vk.com/album-211704031_283523280', '123'),
       ('Селивёрстова Анастасия Валерьевна', 'https://vk.com/album-211704031_283523281', '123'),
       ('Семёнов Дмитрий Валериевич', 'https://vk.com/album-211704031_283523282', '123'),
       ('Семкин Петр Степанович', 'https://vk.com/album-211704031_283523283', '123'),
       ('Силантьева Елена Юрьевна', 'https://vk.com/album-211704031_283523284', '123'),
       ('Симонов Михаил Фёдорович', 'https://vk.com/album-211704031_283523285', '123'),
       ('Спиридонов Сергей Борисович', 'https://vk.com/album-211704031_283523286', '123'),
       ('Строганов Виктор Юрьевич', 'https://vk.com/album-211704031_283523287', '123'),
       ('Строганов Дмитрий Викторович', 'https://vk.com/album-211704031_283523288', '123'),
       ('Сухобоков Андрей Валентинович', 'https://vk.com/album-211704031_283523289', '123'),
       ('Терехов Валерий Игоревич', 'https://vk.com/album-211704031_283523290', '123'),
       ('Тимофеев Виктор Борисович', 'https://vk.com/album-211704031_283523291', '123'),
       ('Филиппович Анна Юрьевна', 'https://vk.com/album-211704031_283523292', '123'),
       ('Хайруллин Рустам Зиннаттулович', 'https://vk.com/album-211704031_283523293', '123'),
       ('Черненький Михаил Валерьевич', 'https://vk.com/album-211704031_283523294', '123'),
       ('Черненький Станислав Валерьевич', 'https://vk.com/album-211704031_283523295', '123'),
       ('Шкуратова Людмила Петровна', 'https://vk.com/album-211704031_283523296', '123'),
       ('Шук Владимир Павлович', 'https://vk.com/album-211704031_283523297', '123'),
       ('Якубов Алексей Ренатович', 'https://vk.com/album-211704031_283523298', '123');
-- +goose StatementEnd

-- +goose Down
-- +goose StatementBegin
DROP TABLE IF EXISTS teacher_albums;
-- +goose StatementEnd