-- +goose Up
-- +goose StatementBegin
CREATE TABLE student_albums
(
    id            serial PRIMARY KEY,
    year          INT,
    study_program VARCHAR(100),
    event         VARCHAR(100),
    url           VARCHAR(255),
    vk_id         INT
);

INSERT INTO student_albums (year, study_program, event, url, vk_id)
VALUES (2024, 'Бакалавриат', 'Защита диплома', 'https://vk.com/album-211704031_283523239', '123'),
       (2024, 'Бакалавриат', 'Тазы', 'https://vk.com/album-211704031_283523140', '123'),
       (2024, 'Бакалавриат', 'Учёба', 'https://vk.com/album-211704031_283523140', '123'),
       (2024, 'Магистратура', 'Защита диплома', 'https://vk.com/album-211704031_283523141', '123'),
       (2024, 'Магистратура', 'Выпускной', 'https://vk.com/album-211704031_283523142', '123'),
       (2024, 'Специалитет', 'Тазы', 'https://vk.com/album-211704031_283523142', '123'),
       (2024, 'Специалитет', 'Защита диплома', 'https://vk.com/album-211704031_283523142', '123'),
       (2024, 'Аспирантура', 'Отдых', 'https://vk.com/album-211704031_283523148', '123'),
       (2024, 'Аспирантура', 'Защита диссертации', 'https://vk.com/album-211704031_283523148', '123'),

       (2023, 'Бакалавриат', 'Защита диплома', 'https://vk.com/album-211704031_283523239', '123'),
       (2023, 'Бакалавриат', 'Тазы', 'https://vk.com/album-211704031_283523140', '123'),
       (2023, 'Бакалавриат', 'Учёба', 'https://vk.com/album-211704031_283523140', '123'),
       (2023, 'Магистратура', 'Защита диплома', 'https://vk.com/album-211704031_283523141', '123'),
       (2023, 'Магистратура', 'Выпускной', 'https://vk.com/album-211704031_283523142', '123'),
       (2023, 'Магистратура', 'Учёба', 'https://vk.com/album-211704031_283523142', '123'),
       (2023, 'Магистратура', 'Отдых', 'https://vk.com/album-211704031_283523142', '123'),
       (2023, 'Аспирантура', 'Защита диссертации', 'https://vk.com/album-211704031_283523148', '123'),

       (2022, 'Бакалавриат', 'Защита диплома', 'https://vk.com/album-211704031_283523239', '123'),
       (2022, 'Бакалавриат', 'Тазы', 'https://vk.com/album-211704031_283523140', '123'),
       (2022, 'Бакалавриат', 'Учёба', 'https://vk.com/album-211704031_283523140', '123'),
       (2022, 'Бакалавриат', 'Отдых', 'https://vk.com/album-211704031_283523140', '123'),
       (2022, 'Магистратура', 'Выпускной', 'https://vk.com/album-211704031_283523142', '123'),
       (2022, 'Специалитет', 'Тазы', 'https://vk.com/album-211704031_283523142', '123'),
       (2022, 'Специалитет', 'Защита диплома', 'https://vk.com/album-211704031_283523142', '123'),
       (2022, 'Специалитет', 'Выпускной', 'https://vk.com/album-211704031_283523142', '123'),

       (2021, 'Бакалавриат', 'Защита диплома', 'https://vk.com/album-211704031_283523239', '123'),
       (2021, 'Магистратура', 'Выпускной', 'https://vk.com/album-211704031_283523142', '123'),

       (2020, 'Специалитет', 'Защита диплома', 'https://vk.com/album-211704031_283523142', '123'),
       (2020, 'Аспирантура', 'Защита диссертации', 'https://vk.com/album-211704031_283523148', '123'),

       (2019, 'Бакалавриат', 'Учёба', 'https://vk.com/album-211704031_283523140', '123');

-- +goose StatementEnd

-- +goose Down
-- +goose StatementBegin
DROP TABLE IF EXISTS student_albums;
-- +goose StatementEnd